texts = {
    "call_about": "Кто я ❓",
    "call_cap": "О CapEdu 🏫",
    "call_way": "Мой путь 🛣",
    "call_works": "Лучшие работы ⭐",
    "call_ai": "ИИ Помощник 🤖",
    "call_back": "Назад ↩",
    "call_hobbies": "Хобби 🎮",
    "call_goals": "Мои цели 🎯",
    "call_mentor": "Ментор 👩‍🏫",
    "call_tg": "ТГ Бот 🤖",
    "call_rps": "Цу-е-фа ✊",
    "call_study": "Викторина 🏆",
    "call_link": "Скачать 🔽",

    "menu": "Привет, {name}!👋 Я бот про Маргулана. Что вам показать?",
    "ai_error": "Что-то пошло не так с ИИ! Попробуйте заново.",
    "about": "*👨‍💻 Я Маргулан - крутой будущий разработчик!*\n\nСейчас занимаюсь и ставлю фокус на изучение языка программирования Python. 8 месяцев опыта программирования на Python. Пока нету других языков, но знаю базу Luau и C++",
    "hobbies": "*Хобби 🎮*\n\n\nЯ люблю играть в майнкрафт и творить, создавать что-то свое. Играю в него уже почти 10лет. То есть видео-игры мне нравятся, а также создание игр мне тоже нравится. Хочу в будущем создавать свои игры, в которые будут играть тысячи людей. Так же я обожаю играть в настольный теннис, хочу стать лучшим в своей школе, пока что",
    "goals": "*Мои цели 🎯*\n\n\n1. Улучшить знания языка программирования Python.\n2. Изучить другие языки, например C++, Luau и C#.\n3. Заработать с этого😎",
    "way": "*Мой путь 🛣*\n\n\nМой путь начался еще в 10 лет, тогда я увлекался командными блоками в Майнкрафт. Тогда мне нравилось строить карты.\nТак же я увлекался созданием плейсов в роблоксе.\n\nИ сейчас я занимаюсь разработкой на языке Python.\n\nА в дальнейшем собираюсь изучать другие языки.",
    "capedu": "*🏫 CAPEdu - онлайн IT школа для детей.*\n\n\nПлюсы в том что здесь готовят ребенка в разных направлениях, и помогают быстро достичь результата. Я в CAPEdu с октября 2025. Я смог создать первый проект уже через неделю! Хоть и проект был легкий, но я считаю что это отличный результат, который CAPEdu мне помог достичь. Попал сюда, когда рекламировали эту школу в нашей школе. Я с другом решили вместе учиться здесь, но выбрали разные направления",
    "mentor": "*🤩 Ментор Айшабиби*\n\n\nМой ментор и наставник - Айшабиби. Я ей благодарен, так как она следит за нашими работами и помогает если у ученика есть вопросы по поводу темы.",
    "works": "Нажмите что бы узнать больше о конкретной работе(Все работы на Python):",
    "ai": "*🧠 ИИ*\n\n\nИскусственный Интеллект привязан к этому боту, задавайте ему вопросы. Что бы узнать больше о Маргулане.",
    "back_menu": "*❕ Меню* Что вам показать?",
    "tg": "*🤖 Телеграм Бот*\n\n\nТелеграм бот, который не дает вам забыть достаточное количество воды в день.\n\n Плюсы:\nПростой код и оптимизация",
    "rps": "*✊ Цу-е-фа*\n\n\nОбыкновенная игра - камень ножницы бумага в консоли Python\n\n Плюсы:\nПростой и понятный всем код",
    "study": "*🏆 Викторина *\n\n\nКонсольная игра, которая помогает вам что-то запомнить.\n\n Плюсы:\nВы сами создаете карточки\nАвторизация"
}

images = {
    "menu": r"C:\Users\User\PyCharmMiscProject\ботик\images\menu.png",
    "me": r"C:\Users\User\PyCharmMiscProject\ботик\images\me.png",
    "hobbies": r"C:\Users\User\PyCharmMiscProject\ботик\images\hobbies.jpg",
    "goals": r"C:\Users\User\PyCharmMiscProject\ботик\images\goals.png",
    "way": r"C:\Users\User\PyCharmMiscProject\ботик\images\way.jpg",
    "capedu": r"C:\Users\User\PyCharmMiscProject\ботик\images\capedu.png",
    "works": r"C:\Users\User\PyCharmMiscProject\ботик\images\works.png",
    "ai": r"C:\Users\User\PyCharmMiscProject\ботик\images\ai.png"
}